* Dependency injection example with system
** Definition
This is a case study project for the [[https://github.com/danielsz/system][system]] library, summing up practices that have emerged in the Clojure landscape. 

It demonstrates the following:

- How [[https://github.com/danielsz/system-dependency-injection/blob/edbdcc2642e3d86eb3363c3c282892e2c246a9c1/src/example/systems.clj#L20][dependency injection]] works with the [[https://github.com/stuartsierra/component][componen]]t library. 
- How Ring handlers are being [[https://github.com/danielsz/system-dependency-injection/blob/edbdcc2642e3d86eb3363c3c282892e2c246a9c1/src/example/handler.clj#L10][closed over]] to expose the database handle.
- How the [[https://github.com/weavejester/duct][Duct]]-style abstractions clearly and cleanly delineate [[https://github.com/danielsz/system-dependency-injection/blob/2682f9e998b87fdedef5b6f243bf11abbc3c7fd4/src/example/systems.clj#L9][endpoints]], [[https://github.com/danielsz/system-dependency-injection/blob/2682f9e998b87fdedef5b6f243bf11abbc3c7fd4/src/example/systems.clj#L10][middleware]] and [[https://github.com/danielsz/system-dependency-injection/blob/2682f9e998b87fdedef5b6f243bf11abbc3c7fd4/src/example/systems.clj#L11][handler]].
- How components are [[https://github.com/danielsz/system-dependency-injection/blob/edbdcc2642e3d86eb3363c3c282892e2c246a9c1/src/example/db.clj#L14][extended]] to provide application-level functionality.

** Mission statement
Names are important. What names? Those behind our favorite movies, that's who! So let’s save them via a web service.
** Installation

In our development environment, we use a in-memory database and a web server listening on port 3025. 

#+BEGIN_SRC sh
$ boot dev
#+END_SRC

Or, if you don't intend to connect with a REPL to the running system, type simply:

#+BEGIN_SRC sh
$ boot dev-run
#+END_SRC

In our production environment, we use a persistent database and a web server listening on port 8008.

#+BEGIN_SRC sh
$ boot prod-run
#+END_SRC

** Usage

To search for a movie’s director:
#+BEGIN_SRC sh :results output replace :exports both
curl -H "Content-Type: application/edn" -X POST -d '{:movie "Realm of the Senses"}' http://localhost:3025/movie 
#+END_SRC

#+RESULTS:
: {:director ("Nagisa Ōshima")}

To add a director to our database: 
#+BEGIN_SRC sh :results silent
curl -H "Content-Type: application/edn" -X PUT -d '{:director "Nagisa Ōshima"}' http://localhost:3025/director
#+END_SRC

To list directors in our database: 
#+BEGIN_SRC sh :results output replace :exports both
curl http://localhost:3025/directors
#+END_SRC

#+RESULTS:
: ("Nagisa Ōshima")

Let's look for another all-time favorite.  
#+BEGIN_SRC sh :results output replace :exports both
curl -H "Content-Type: application/edn" -X POST -d '{:movie "Professione: reporter"}' http://localhost:3025/movie 
#+END_SRC

#+RESULTS:
: {:director ("Michelangelo Antonioni")}

Now that we know the name of the director, we can persist it to our database.
#+BEGIN_SRC sh :results silent
curl -H "Content-Type: application/edn" -X PUT -d '{:director "Michelangelo Antonioni"}' http://localhost:3025/director
#+END_SRC

Let's verify it's there:
#+BEGIN_SRC sh :results output replace :exports both
curl http://localhost:3025/directors
#+END_SRC

#+RESULTS:
: ("Nagisa Ōshima" "Michelangelo Antonioni")

Let's repeat this one more time for a third movie/director: 
#+BEGIN_SRC sh :results output replace :exports both
curl -H "Content-Type: application/edn" -X POST -d '{:movie " À bout de souffle"}' http://localhost:3025/movie 
#+END_SRC

#+RESULTS:
: {:director ("Jean-Luc Godard")}

Saving to database:
#+BEGIN_SRC sh :results silent
curl -H "Content-Type: application/edn" -X PUT -d '{:director "Jean-Luc Godard"}' http://localhost:3025/director
#+END_SRC

We should now have three directors in our database:
#+BEGIN_SRC sh :results output replace :exports both
curl http://localhost:3025/directors
#+END_SRC

#+RESULTS:
: ("Nagisa Ōshima" "Michelangelo Antonioni" "Jean-Luc Godard")

Let's suppose we want to remove one. 
#+BEGIN_SRC sh :results silent
curl -H "Content-Type: application/edn" -X DELETE -d '{:director "Nagisa Ōshima"}' http://localhost:3025/director
#+END_SRC

Let's verify the removal was properly executed.
#+BEGIN_SRC sh :results output replace :exports both
curl http://localhost:3025/directors
#+END_SRC

#+RESULTS:
: ("Michelangelo Antonioni" "Jean-Luc Godard")


** License
Distributed under the [[http://opensource.org/licenses/eclipse-1.0.php][Eclipse Public License]], the same as Clojure.

